In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a', 'b','c']

lista = [10,20,30]

arr = np.array([10,20,30])

d = {'a':10, 'b':20, 'c':30}

In [4]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data=labels, index=lista)

10    a
20    b
30    c
dtype: object

In [6]:
pd.Series(labels, lista)

10    a
20    b
30    c
dtype: object

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
ser1 = pd.Series([1, 2, 3, 4], index=['EUA', 'Alemanha', 'Russia', 'Japão'])

In [10]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [11]:
ser2 = pd.Series([1, 2, 5, 4], index=['EUA', 'Alemanha', 'Italia', 'Japão'])

In [12]:
ser2

EUA         1
Alemanha    2
Italia      5
Japão       4
dtype: int64

In [13]:
ser1[['EUA', 'Japão']]

EUA      1
Japão    4
dtype: int64

In [14]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
Russia      NaN
dtype: float64

DataFrames

In [15]:
from numpy.random import randn

In [16]:
df = pd.DataFrame(randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [17]:
df

          W         X         Y         Z
A -1.162066 -0.375824 -0.635151 -0.557842
B  0.964595  1.817221 -1.463482  1.250039
C -1.331913 -1.057326  0.258823  0.282474
D -0.575934  0.321854 -0.864075 -1.065984
E -0.001154  0.270536 -0.823671 -1.168975

In [18]:
df[['W']]

          W
A -1.162066
B  0.964595
C -1.331913
D -0.575934
E -0.001154

In [19]:
df["new"] = df["W"] + df["Y"]

In [20]:
df

          W         X         Y         Z       new
A -1.162066 -0.375824 -0.635151 -0.557842 -1.797217
B  0.964595  1.817221 -1.463482  1.250039 -0.498887
C -1.331913 -1.057326  0.258823  0.282474 -1.073090
D -0.575934  0.321854 -0.864075 -1.065984 -1.440009
E -0.001154  0.270536 -0.823671 -1.168975 -0.824825

In [21]:
df2 = df.drop('new', axis=1)

In [22]:
df.drop('new', axis=1, inplace=True)

In [23]:
df2

          W         X         Y         Z
A -1.162066 -0.375824 -0.635151 -0.557842
B  0.964595  1.817221 -1.463482  1.250039
C -1.331913 -1.057326  0.258823  0.282474
D -0.575934  0.321854 -0.864075 -1.065984
E -0.001154  0.270536 -0.823671 -1.168975

In [24]:
df

          W         X         Y         Z
A -1.162066 -0.375824 -0.635151 -0.557842
B  0.964595  1.817221 -1.463482  1.250039
C -1.331913 -1.057326  0.258823  0.282474
D -0.575934  0.321854 -0.864075 -1.065984
E -0.001154  0.270536 -0.823671 -1.168975

In [25]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -1.162066 -0.375824 -0.635151 -0.557842
B  0.964595  1.817221 -1.463482  1.250039

In [26]:
df.iloc[0, 2]

-0.6351509959142593

In [27]:
df.iloc[1:4, 1:3]

          X         Y
B  1.817221 -1.463482
C -1.057326  0.258823
D  0.321854 -0.864075

In [28]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B  0.964595  1.817221       NaN  1.250039
C       NaN       NaN  0.258823  0.282474
D       NaN  0.321854       NaN       NaN
E       NaN  0.270536       NaN       NaN

In [29]:
df

          W         X         Y         Z
A -1.162066 -0.375824 -0.635151 -0.557842
B  0.964595  1.817221 -1.463482  1.250039
C -1.331913 -1.057326  0.258823  0.282474
D -0.575934  0.321854 -0.864075 -1.065984
E -0.001154  0.270536 -0.823671 -1.168975

In [30]:
df['Z'] > 0

A    False
B     True
C     True
D    False
E    False
Name: Z, dtype: bool

In [31]:
df[df['Z'] > 0]

          W         X         Y         Z
B  0.964595  1.817221 -1.463482  1.250039
C -1.331913 -1.057326  0.258823  0.282474

In [32]:
df[(df['Z'] > 0) & (df['W'] > 0)]

          W         X         Y         Z
B  0.964595  1.817221 -1.463482  1.250039

mais detalhes

In [33]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [34]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [35]:
df.reset_index(inplace=True)

In [36]:
df.set_index("index", inplace=True)

In [37]:
df

              W         X         Y         Z
index
A     -1.162066 -0.375824 -0.635151 -0.557842
B      0.964595  1.817221 -1.463482  1.250039
C     -1.331913 -1.057326  0.258823  0.282474
D     -0.575934  0.321854 -0.864075 -1.065984
E     -0.001154  0.270536 -0.823671 -1.168975

In [38]:
novoind = 'CA NY WY OR CO'.split()

In [39]:
df["novo_index"] = novoind

In [40]:
df.reset_index().set_index("novo_index")

           index         W         X         Y         Z
novo_index
CA             A -1.162066 -0.375824 -0.635151 -0.557842
NY             B  0.964595  1.817221 -1.463482  1.250039
WY             C -1.331913 -1.057326  0.258823  0.282474
OR             D -0.575934  0.321854 -0.864075 -1.065984
CO             E -0.001154  0.270536 -0.823671 -1.168975

Hierarquia de índices e índices múltiplos

In [41]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

In [42]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [43]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [44]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [45]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index, columns=['A', 'B'])
df

             A         B
G1 1 -0.802431  0.466303
   2 -0.035534  0.425383
   3  0.663114  0.837267
G2 1  0.050188 -0.303215
   2 -0.567519 -0.442246
   3 -0.535329 -0.170337

In [46]:
df.loc['G1'].loc[1]

A   -0.802431
B    0.466303
Name: 1, dtype: float64

In [47]:
df.index.names = ['Grupo', 'Numero']

In [48]:
df

                     A         B
Grupo Numero
G1    1      -0.802431  0.466303
      2      -0.035534  0.425383
      3       0.663114  0.837267
G2    1       0.050188 -0.303215
      2      -0.567519 -0.442246
      3      -0.535329 -0.170337

In [49]:
df.xs(1, level='Numero')

              A         B
Grupo
G1    -0.802431  0.466303
G2     0.050188 -0.303215